ana001_interIsoFoam/run/system/controlDict
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    controlDict;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
application    interIsoFoam;
startFrom    latestTime;
startTime    0;
stopAt    endTime;
endTime    10;
writeControl    adjustableRunTime;
writeInterval    0.1;
deltaT    1e-4;
purgeWrite    0;
writeFormat    ascii;
writePrecision    12;
writeCompression    off;//on;
timeFormat    general;
timePrecision    12;
runTimeModifiable    on;
adjustTimeStep   on;
maxCo    5;
maxDeltaT    1.0;
maxAlphaCo    2.0;
functions
{
	#includeFunc    residuals;
	ABORT
	{
		type    abort;
		libs    ("libutilityFunctionObjects.so");
		file    "<case>/ABORT";
		action    nextWrite;
	}

	fieldMinMax
	{
		type    fieldMinMax;
		libs    ("libfieldFunctionObjects.so");
		region    region0;
		writeToFile    yes;
		log    yes;
		location    yes;
		mode    magnitude;
		fields    ( U  p_rgh  alpha.liquid );
	}

}

