ana001_interIsoFoam/run/system/fvSolution
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    fvSolution;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
solvers
{
	U
	{
		solver    smoothSolver;
		tolerance    1e-6;
		minIter    1;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
	}

	UFinal
	{
		$U    ;
		tolerance    1e-6;
		relTol    0.0;
	}

	p_rgh
	{
		solver    GAMG;
		tolerance    1e-6;
		relTol    0.01;
		minIter    1;
		smoother    DICGaussSeidel;
		nPreSweeps    0;
		nPostSweeps    2;
		cacheAgglomeration    on;
		agglomerator    faceAreaPair;
		nCellsInCoarsestLevel    200;
		mergeLevels    1;
		nFinestSweeps    2;
		nVcycles    2;
	}

	p_rghFinal
	{
		$p_rgh    ;
		tolerance    1e-6;
		relTol    0.0;
	}

	"pcorr.*"
	{
		$p_rgh    ;
		tolerance    1e-2;
		relTol    0.0;
	}

	"k|omega|epsilon|nuTilda"
	{
		solver    smoothSolver;
		tolerance    1e-6;
		minIter    1;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
	}

	"kFinal|omegaFinal|epsilonFinal|nuTildaFinal"
	{
		$k    ;
		tolerance    1e-6;
		relTol    0.0;
	}

	"alpha.*"
	{
		solver    smoothSolver;
		tolerance    1e-6;
		relTol    0.1;
		smoother    symGaussSeidel;
		preconditioner    DILU;
		MULESCorr    on;
		nLimiterIter    5;
		alphaApplyPrevCorr    on;
		minIter    1;
		nAlphaCorr    1;
		nAlphaSubCycles    1;
		cAlpha    1;
		icAlpha    0;
		nAlphaSmoothCurvature    0;
		isoFaceTol    1e-8;
		surfCellTol    1e-8;
		nAlphaBounds    3;
		snapTol    1e-12;
		clip    on;
		writeSurfCells    off;
		writeBoundedCells    off;
		writeIsoFaces    off;
		reconstructionScheme    plicRDF;
	}

}

PIMPLE
{
	momentumPredictor    on;
	consistent    off;
	nNonOrthogonalCorrectors    0;
	pRefCell    0;
	pRefValue    0;
	nOuterCorrectors    1;
	nCorrectors    3;
	correctPhi    off;
	turbOnFinalIterOnly    on;
	moveMeshOuterCorrectors    on;
	residualControl
	{
		U
		{
			tolerance    1e-5;
			relTol    0;
		}

		p_rgh
		{
			tolerance    5e-5;
			relTol    0;
		}

	}

}

relaxationFactors
{
	fields
	{
		p_rgh    1;
		p_rghFinal    1;
	}

	equations
	{
		U    1;
		UFinal    1;
		"k|epsilon|omega|nuTilda"    1;
		"(k|epsilon|omega|nuTilda)Final"    1;
		"alpha.*"    1;
	}

}

cache
{
	     grad(U);
}

