ana001_interIsoFoam/run/system/changeDictionaryDict
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    changeDictionaryDict;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
boundary
{
	Zmin_vol_2-4_3
	{
		type    wall;
	}

	empty2_wall_2-4_3
	{
		type    empty;
	}

	victim_wall_2-4_3
	{
		type    wall;
	}

	empty1_wall_2-4_3
	{
		type    empty;
	}

	perpetrator_wall_2-4_3
	{
		type    wall;
	}

	perpetrator_wall_2-6_3
	{
		type    wall;
	}

	Xmin_press_2-4_3
	{
		type    wall;
	}

	Ymax_vol_2-4_3
	{
		type    patch;
	}

	Xmax_press_2-4_3
	{
		type    wall;
	}

	outelt
	{
		type    patch;
	}

}

