ana001_interIsoFoam/run/system/residuals
#includeEtc    "caseDicts/postProcessing/numerical/solverInfo.cfg";
fields    (".*");
region    region0;
